---
kind: property
id: P:Autodesk.Revit.DB.ThermalProperties.ThermalResistance
source: html/e234bed0-4903-7181-dcc2-de8d7e273eb1.htm
---
# Autodesk.Revit.DB.ThermalProperties.ThermalResistance Property

The calculated thermal resistance value (R-Value).
 The unit is meter-squared kelvin per watt ((m^2*K)/Watt).

## Syntax (C#)
```csharp
public double ThermalResistance { get; }
```